; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p8---int100n150-m25---int100c110---s91---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level15 level15)
(sum level0 level18 level18)
(sum level0 level20 level20)
(sum level1 level2 level3)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level15 level16)
(sum level1 level18 level19)
(sum level1 level20 level21)
(sum level2 level2 level4)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level15 level17)
(sum level2 level18 level20)
(sum level2 level20 level22)
(sum level3 level2 level5)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level15 level18)
(sum level3 level18 level21)
(sum level3 level20 level23)
(sum level4 level2 level6)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level15 level19)
(sum level4 level18 level22)
(sum level4 level20 level24)
(sum level5 level2 level7)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level15 level20)
(sum level5 level18 level23)
(sum level5 level20 level25)
(sum level6 level2 level8)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level15 level21)
(sum level6 level18 level24)
(sum level6 level20 level26)
(sum level7 level2 level9)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level15 level22)
(sum level7 level18 level25)
(sum level7 level20 level27)
(sum level8 level2 level10)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level15 level23)
(sum level8 level18 level26)
(sum level8 level20 level28)
(sum level9 level2 level11)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level15 level24)
(sum level9 level18 level27)
(sum level9 level20 level29)
(sum level10 level2 level12)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level15 level25)
(sum level10 level18 level28)
(sum level10 level20 level30)
(sum level11 level2 level13)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level15 level26)
(sum level11 level18 level29)
(sum level11 level20 level31)
(sum level12 level2 level14)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level15 level27)
(sum level12 level18 level30)
(sum level12 level20 level32)
(sum level13 level2 level15)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level15 level28)
(sum level13 level18 level31)
(sum level13 level20 level33)
(sum level14 level2 level16)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level15 level29)
(sum level14 level18 level32)
(sum level14 level20 level34)
(sum level15 level2 level17)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level15 level30)
(sum level15 level18 level33)
(sum level15 level20 level35)
(sum level16 level2 level18)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level15 level31)
(sum level16 level18 level34)
(sum level16 level20 level36)
(sum level17 level2 level19)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level15 level32)
(sum level17 level18 level35)
(sum level17 level20 level37)
(sum level18 level2 level20)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level15 level33)
(sum level18 level18 level36)
(sum level19 level2 level21)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level15 level34)
(sum level19 level18 level37)
(sum level20 level2 level22)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level15 level35)
(sum level21 level2 level23)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level15 level36)
(sum level22 level2 level24)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level15 level37)
(sum level23 level2 level25)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level24 level2 level26)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level25 level2 level27)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level26 level2 level28)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level27 level2 level29)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level28 level2 level30)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level29 level2 level31)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level30 level2 level32)
(sum level30 level7 level37)
(sum level31 level2 level33)
(sum level32 level2 level34)
(sum level33 level2 level35)
(sum level34 level2 level36)
(sum level35 level2 level37)

(connected l0 l1)
(fuelcost level15 l0 l1)
(connected l0 l2)
(fuelcost level20 l0 l2)
(connected l0 l3)
(fuelcost level8 l0 l3)
(connected l1 l0)
(fuelcost level15 l1 l0)
(connected l1 l2)
(fuelcost level7 l1 l2)
(connected l1 l3)
(fuelcost level18 l1 l3)
(connected l2 l0)
(fuelcost level20 l2 l0)
(connected l2 l1)
(fuelcost level7 l2 l1)
(connected l2 l3)
(fuelcost level2 l2 l3)
(connected l3 l0)
(fuelcost level8 l3 l0)
(connected l3 l1)
(fuelcost level18 l3 l1)
(connected l3 l2)
(fuelcost level2 l3 l2)

(at t0 l0)
(fuel t0 level37)
(= (total-cost) 0)

(at p0 l1)
(at p1 l2)
(at p2 l1)
(at p3 l3)
(at p4 l1)
(at p5 l1)
(at p6 l2)
(at p7 l2)
)

(:goal
(and
(at p0 l0)
(at p1 l1)
(at p2 l3)
(at p3 l1)
(at p4 l3)
(at p5 l0)
(at p6 l3)
(at p7 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l0 l3 level29 level8 level37)
   deleted: (at t0 l0) (fuel t0 level37)
   added: (at t0 l3) (fuel t0 level29)
   goals met: 0 of 8
2. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 0 of 8
3. (drive t0 l3 l2 level27 level2 level29)
   deleted: (at t0 l3) (fuel t0 level29)
   added: (at t0 l2) (fuel t0 level27)
   goals met: 0 of 8
4. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 8
5. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 8
6. (drive t0 l2 l1 level20 level7 level27)
   deleted: (at t0 l2) (fuel t0 level27)
   added: (at t0 l1) (fuel t0 level20)
   goals met: 0 of 8
7. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 8
8. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 8
9. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 8
10. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 8
11. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 1 of 8
12. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 2 of 8
13. (drive t0 l1 l2 level13 level7 level20)
   deleted: (at t0 l1) (fuel t0 level20)
   added: (at t0 l2) (fuel t0 level13)
   goals met: 2 of 8
14. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 2 of 8
15. (drive t0 l2 l3 level11 level2 level13)
   deleted: (at t0 l2) (fuel t0 level13)
   added: (at t0 l3) (fuel t0 level11)
   goals met: 2 of 8
16. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 3 of 8
17. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 4 of 8
18. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 5 of 8
19. (unload p7 t0 l3)
   deleted: (in p7 t0)
   added: (at p7 l3)
   goals met: 6 of 8
20. (drive t0 l3 l0 level3 level8 level11)
   deleted: (at t0 l3) (fuel t0 level11)
   added: (at t0 l0) (fuel t0 level3)
   goals met: 6 of 8
21. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 7 of 8
22. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 8 of 8
